### Dir: aws/personal/project_a/
#### Terraform Plan 📖`success`
<details><summary>Init, Fmt, Verify, Plan Output</summary>

```

aws_ebs_volume.example[0]: Refreshing state... [id=vol-034638b77cc149501]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.example[0] will be created
  # (moved from aws_ebs_volume.example)
  + resource "aws_ebs_volume" "example" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "HelloWorld 01"
        }
      + tags_all          = {
          + "Name" = "HelloWorld 01"
        }
      + throughput        = (known after apply)
      + type              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...


```

</details>

*Pusher: @kavehmz, Action: `pull_request`, Workflow: `Terraform Plan`*